---
kind: other
id: Methods.T:Autodesk.Revit.DB.Structure.StructuralSectionsServiceData
source: html/9e1c33b7-d665-9390-f1f4-86490757a8fe.htm
---
# StructuralSectionsServiceData Methods

Returns the list of Ids of the current elements.